Repository: pactus-project/pactus-gui
Catalog: lib/l10n/app_*.arb
Languages: es, fr

# title
source: Hello, World !
es: Hola Mundo!
fr: Bonjour le Monde!

# subtitle
source: Welcome to Localization
es: Bienvenido a la Localización
fr: Bienvenue dans la Localisation

# description
source: You have pushed the button this many times:
es: Has presionado el botón esta cantidad de veces:
fr: Vous avez appuyé sur le bouton autant de fois:

source: Switch language
es: Cambiar idioma
fr: Changer de langue

# welcome_title
source: Welcome to the Future of Blockchain with Pactus!
es: ¡Bienvenido al Futuro de Blockchain con Pactus!
fr: Bienvenue dans le Futur de la Blockchain avec Pactus!

# welcome_description
source: Where the future of blockchain unfolds with trust and transparency in every transaction. Join us in shaping the decentralized revolution!
es: Donde el futuro de blockchain se despliega con confianza y transparencia en cada transacción. ¡Únase a nosotros para dar forma a una revolución descentralizada!
fr: Où lavenir de la blockchain se déploie avec confiance et transparence dans chaque transaction. Rejoignez-nous pour façonner une révolution décentralisée!

# start_button_text
source: Get Started
es: Comenzar
fr: Commencer

source: Initialize mode
es: Modo de inicialización
fr: Mode dinitialisation

source: Wallet seed
es: Semilla de billetera
fr: Graine de portefeuille

source: Confirm seed
es: Confirmar semilla
fr: Confirmer la graine

source: Confirm
fr: Confirmer

source: Master Password
es: contraseña maestra
fr: mot de passe principal

source: Validator config
es: Configuración del validador
fr: Configuration du validateur

source: Initializing
es: Inicializando
fr: Initialisation

source: Finish
es: Finalizar
fr: Terminer

source: Initiate your node
es: Iniciar tu nodo
fr: Initialiser votre nœud

source: Initiate your node for first time
es: Iniciar tu nodo por primera vez
fr: Initialiser votre nœud pour la première fois

source: Create local node from scratch
fr: Créer un nœud local à partir de zéro

# restore_local_node_from_seed_pharse
source: Restore local node from seed phrase
es: Restaurar nodo local desde frase semilla
fr: Restaurer le nœud local à partir de la phrase germinative

source: Connect to remote node
es: Conectar a nodo remoto
fr: Se connecter à un nœud distant

source: Remote Address
es: Dirección remota
fr: Adresse distante

source: Auth Method
es: Método de autenticación
fr: Méthode dauthentification

source: Username
es: Nombre de usuario
fr: Nom dutilisateur

source: Password
es: Contraseña
fr: Mot de passe

# unlock_wallet
source: Unlock
es: Desbloquear
fr: Déverrouiller

# unlock_wallet_description
source: Enter the master password to unlock
es: Ingrese la contraseña maestra para desbloquear
fr: Entrez le mot de passe principal pour déverrouiller

source: Enter your password
es: Ingrese su contraseña
fr: Entrez votre mot de passe

source: Password cannot be empty
es: La contraseña no puede estar vacía
fr: Le mot de passe ne peut pas être vide

source: Incorrect password
es: Contraseña incorrecta
fr: Mot de passe incorrect

# unlock_failed
source: Unlock failed. Please try again.
es: Error al desbloquear. Por favor intente nuevamente.
fr: Échec du déverrouillage. Veuillez réessayer.

source: Error
fr: Erreur

source: Select
es: Seleccionar
fr: Sélectionner

source: Working directory
es: Directorio de trabajo
fr: Répertoire de travail

source: Choose your directory
es: Elija su directorio
fr: Choisissez votre répertoire

source: Select folder
es: Seleccionar carpeta
fr: Sélectionner un dossier

# validator_config_description
source: Setting your path to decentralized consensus with precision and scalability
es: Configurando tu camino hacia un consenso descentralizado con precisión y escalabilidad
fr: Configuration de votre chemin vers un consensus décentralisé avec précision et évolutivité

source: Number Of Validators
es: Número de Validadores
fr: Nombre de Validateurs

# directory_not_empty
source: Directory is not empty. Need empty directory to continue.
es: El directorio no está vacío. Necesita un directorio vacío para continuar.
fr: Le répertoire nest pas vide. Un répertoire vide est nécessaire pour continuer.

# your_journey_finalized
source: Your journey finalized, your success on the horizon
es: Tu viaje finalizado, tu éxito en el horizonte
fr: Votre voyage finalisé, votre succès à lhorizon

source: Go to Dashboard
es: Ir al Panel
fr: Aller au Tableau de bord

# go_to_dashboard_description
source: Go to dashboard to manage your node
es: Ir al panel para administrar tu nodo
fr: Aller au tableau de bord pour gérer votre nœud

source: Next
es: Siguiente
fr: Suivant

source: Basic Auth
es: Autenticación básica
fr: Authentification de base

# generation_seed_title
source: Your wallet generation seed
es: Tu semilla de generación de billetera
fr: Votre graine de génération de portefeuille

# generation_seed_description
source: Initiate your cryptographic journey with confidence
es: Inicia tu viaje criptográfico con confianza
fr: Commencez votre voyage cryptographique en toute confiance

# generation_seed_note1
source: Please write these ___ words on paper
es: Por favor escribe estas ___ palabras en papel
fr: Veuillez écrire ces ___ mots sur papier

# generation_seed_note2
source: This seed will allow you to recover your wallet in case of computer failure
es: Esta semilla te permitirá recuperar tu billetera en caso de falla de la computadora
fr: Cette graine vous permettra de récupérer votre portefeuille en cas de panne informatique

source: WARNING
es: ADVERTENCIA
fr: AVERTISSEMENT

# generation_seed_warning1
source: Never disclose your seed
es: Nunca reveles tu semilla
fr: Ne divulguez jamais votre graine

# generation_seed_warning2
source: Never type it on a website
es: Nunca la ingreses en un sitio web
fr: Ne la saisissez jamais sur un site web

# generation_seed_warning3
source: Do not store it electronically
es: No la almacenes electrónicamente
fr: Ne la stockez pas électroniquement

source: Copy to clipboard
es: Copiar al portapapeles
fr: Copier dans le presse-papiers

# clipboard_dialog_title
source: Copy Successful
es: Copia exitosa
fr: Copie réussie

# clipboard_dialog_content
source: Your seed words have been copied to the clipboard
es: Tus palabras semilla han sido copiadas al portapapeles
fr: Vos mots de graine ont été copiés dans le presse-papiers

# node_activation_powering
source: Node Activation, Powering the Pulse of the Blockchain
es: Activación del Nodo, Alimentando el Pulso de la Blockchain
fr: Activation du Nœud, Alimenter le Pouls de la Blockchain

source: Initialization Complete
es: Inicialización Completa
fr: Initialisation Terminée

source: Node Ready
es: Nodo Listo
fr: Nœud Prêt

source: Initialization Failed
es: Inicialización Fallida
fr: Échec de lInitialisation

source: Retry
es: Reintentar
fr: Réessayer

source: Initialization Success
es: Inicialización Exitosa
fr: Succès de lInitialisation

# invalid_validator_number
source: Invalid validator number provided
es: Número de validador inválido proporcionado
fr: Nombre de validateur fourni invalide

source: Unlock Button
es: Acceder al tablero
fr: Déverrouiller

# seed_twelve_words
source: 12 words
es: 12 palabras
fr: 12 mots

# seed_twenty_four_words
source: 24 words
es: 24 palabras
fr: 24 mots

source: Restoration
es: Restauración
fr: Restauration

# restoration_seed_title
source: Restoration Seed
es: Semilla de Restauración
fr: Graine de Restauration

# restoration_seed_description
source: Restoration seed, your key to digital resilience and recovery
es: Semilla de restauración, tu clave para la resiliencia y recuperación digital
fr: Graine de restauration, votre clé pour la résilience et la récupération numériques

# please_input_all_fields
source: Please input all fields before continuing
es: Por favor ingrese todos los campos antes de continuar
fr: Veuillez entrer tous les champs avant de continuer

# master_password_description
source: Your keystone to cryptographic security. This password makes your node secure
es: Tu piedra angular para la seguridad criptográfica. Esta contraseña hace que tu nodo sea seguro.
fr: Votre clé de voûte pour la sécurité cryptographique. Ce mot de passe sécurise votre nœud.

source: Confirm Password
es: Confirmar contraseña
fr: Confirmer le mot de passe

source: skip
es: Omitir
fr: Passer

source: Back
es: Atrás
fr: Retour

# confirmation_seed_title
source: Confirmation Seed
es: Confirmación de la semilla
fr: Confirmation de la graine

# confirmation_seed_description
source: Embark with assurance, your gateway to secure seed generation
es: Embárcate con confianza, tu puerta de entrada a una generación de semillas segura
fr: Embarquez en toute confiance, votre passerelle vers une génération de graine sécurisée

source: Log
es: Registro
fr: Journal

source: Clock
es: Reloj
fr: Horloge

source: Connection
es: Conexión
fr: Connexion

source: Reachability
es: Alcance
fr: Atteignabilité

source: Clock Offset
es: Desplazamiento de reloj
fr: Décalage horaire

# clock_offset_description
source: 0 second(s)
es: 0 segundos
fr: 0 secondes

source: Dashboard
es: Panel de control
fr: Tableau de bord

source: Wallet
es: Monedero
fr: Portefeuille

source: Node Logs
es: Registros del nodo
fr: Journaux du nœud

source: Settings
es: Configuración
fr: Paramètres

source: FAQs
es: Preguntas frecuentes
fr: FAQ

source: Accent Color
fr: Couleur d Accent

source: About
es: Acerca de
fr: À propos

source: Language
fr: Langue

# answer_faq
source: This FAQ (Frequently Asked Questions) page aims to provide helpful information and guidance on common questions and concerns related to Pactus.
es: Esta página de Preguntas Frecuentes (FAQ) tiene como objetivo proporcionar información útil y orientación sobre preguntas y preocupaciones comunes relacionadas con Pactus.
fr: Cette page de FAQ (Foire Aux Questions) vise à fournir des informations utiles et des conseils sur les questions et préoccupations courantes liées à Pactus.

source: What does "Pactus" mean?
es: ¿Qué significa "Pactus"?
fr: Que signifie "Pactus" ?

# answer_what_does_pactus_mean
source: The word "Pactus" is of Latin origin and means "to agree together", "contract", or "transact". In English, the term "Pact" is derived from the Latin word "Pactus".
es: La palabra "Pactus" es de origen latino y significa "acordar juntos", "contrato" o "transacción". En inglés, el término "Pact" deriva de la palabra latina "Pactus".
fr: Le mot "Pactus" vient du latin et signifie "se mettre en accord", "contrat" ou "transaction". En anglais, le terme "Pact" provient du mot latin "Pactus".

source: Is Pactus a copy of any other blockchain?
es: ¿Es Pactus una copia de alguna otra blockchain?
fr: Pactus est-il une copie de une autre blockchain ?

# answer_is_pactus_a_copy_of_any_other_blockchain
source: No, Pactus is not a copy or a derivative of any other blockchain. It is a new and unique blockchain protocol that has been designed from scratch. The consensus mechanism used in Pactus is unique and specifically created to solve the scalability issue of validators in the Proof of Stake blockchains.
es: No, Pactus no es una copia ni un derivado de ninguna otra blockchain. Es un protocolo de blockchain nuevo y único que ha sido diseñado desde cero. El mecanismo de consenso utilizado en Pactus es único y creado específicamente para resolver el problema de scalabilidad de los validadores en las blockchains de Prueba de Participación.
fr: Non, Pactus ne représente ni une copie ni une version dérivée de une autre blockchain. Il s’agit d’un protocole de blockchain entièrement nouveau et unique, développé depuis le début. Le mécanisme de consensus utilisé dans Pactus est spécifique et a été créé pour résoudre le problème de la scalabilité des validateurs dans les blockchains fondées sur la Preuve de Participation.

source: Did Pactus have an ICO?
es: ¿Tuvo Pactus una ICO?
fr: Pactus a-t-il eu une ICO ?

# answer_did_pactus_have_an_ico
source: No, Pactus did not have any ICO or Initial Coin Offering.
es: No, Pactus no tuvo ninguna ICO o Oferta Inicial de Monedas.
fr: Non, Pactus ne a pas eu une ICO ou une Offre Initiale de Monnaies.

source: Where can I buy Pactus coins?
es: ¿Dónde puedo comprar monedas Pactus?
fr: Où puis-je acheter des pièces Pactus ?

# answer_where_can_i_buy_pactus_coins
source: Pactus does not have any pre-sales coins. The only way to obtain Pactus coins at the moment is by installing the Pactus software and actively participating in block validation. By engaging in the network and contributing to block validation, you will be rewarded with Pactus coins.
es: Pactus no tiene monedas en preventa. La única forma de obtener monedas Pactus en este momento es instalando el software Pactus y participando activamente en la validación de bloques. Al participar en la red y contribuir a la validación de bloques, serás recompensado con monedas Pactus.
fr: Pactus ne possède aucune pièce en prévente. La seule manière pour obtenir des pièces Pactus pour le moment est de installer le logiciel Pactus et de participer activement à la validation des blocs. En participant au réseau et en contribuant à la validation, vous recevrez des pièces Pactus en récompense.

source: How is Pactus different from Bitcoin?
es: ¿En qué se diferencia Pactus de Bitcoin?
fr: En quoi Pactus est-il différent de Bitcoin ?

# answer_how_is_pactus_different_from_bitcoin
source: Pactus and Bitcoin are two different types of blockchain networks. While Bitcoin uses a process called "Proof of Work" to secure its network, Pactus uses a different method called "Proof of Stake". This means that instead of mining, validators are responsible for voting on incoming blocks and must hold a certain amount of the network coin, known as "stake", as a security deposit to prevent malicious behavior.
es: Pactus y Bitcoin son dos tipos diferentes de redes blockchain. Mientras que Bitcoin utiliza un proceso llamado "Prueba de Trabajo" para asegurar su red, Pactus usa un método diferente llamado "Prueba de Participación". Esto significa que, en lugar de minar, los validadores son responsables de votar sobre los bloques entrantes y deben poseer una cierta cantidad de monedas de la red, conocida como "participación", como depósito de seguridad para prevenir comportamientos maliciosos.
fr: Pactus et Bitcoin sont deux types de réseaux blockchain différents. Alors que Bitcoin utilise un processus appelé "Preuve de Travail" pour sécuriser son réseau, Pactus utilise une méthode différente appelée "Preuve de Enjeu". Cela signifie que au lieu de miner, les validateurs sont responsables de voter sur les blocs entrants et doivent détenir une certaine quantité de pièces du réseau, appelée "enjeu", comme dépôt de garantie pour prévenir les comportements malveillants.

source: How is Pactus different from Ethereum?
es: ¿En qué se diferencia Pactus de Ethereum?
fr: En quoi Pactus est-il différent de Ethereum ?

# answer_how_is_pactus_different_from_ethereum
source: Pactus and Ethereum are both Proof of Stake blockchains, but they differ in their approach to running a validator. Running a validator on Ethereum can be challenging and requires 32 Ethereum coins to stake. In Pactus, there is no fixed amount for staking. Pactus is specifically designed to be more accessible to normal users, and you can run the Pactus blockchain on your personal computer with basic hardware.
es: Pactus y Ethereum son ambas blockchains de Prueba de Participación, pero difieren en su enfoque para ejecutar un validador. Ejecutar un validador en Ethereum puede ser desafiante y requiere 32 monedas Ethereum para participar. En Pactus, no hay una cantidad fija para la participación. Pactus está diseñado específicamente para ser más accesible para usuarios normales, y puedes ejecutar la blockchain Pactus en tu computadora personal con hardware básico.
fr: Pactus et Ethereum sont tous les deux des blockchains à Preuve de Enjeu, mais ils diffèrent dans leur approche pour exécuter un validador. Exécuter un validador sur Ethereum peut être difficile et nécessite 32 pièces Ethereum pour miser. Dans Pactus, il ne y a pas de montant fixe pour miser. Pactus est spécifiquement conçu pour être plus accessible aux utilisateurs ordinaires, et vous pouvez exécuter la blockchain Pactus sur votre ordinateur personnel avec un matériel de base.

source: About Pactus GUI
es: Acerca de Pactus GUI
fr: À propos de Pactus GUI

# answer_about_pactus_gui
source: Pactus GUI is a user-friendly, open-source graphical interface built to provide seamless access to the Pactus blockchain for both beginners and advanced users. Designed to simplify blockchain interaction, Pactus GUI offers an intuitive layout and comprehensive tools for managing nodes, validating transactions, and observing blockchain activity in real time. Through this interface, users can easily perform complex blockchain operations without needing command-line experience, making it accessible for a wide range of participants.
es: Pactus GUI es una interfaz gráfica de código abierto y fácil de usar diseñada para proporcionar un acceso fluido a la blockchain de Pactus tanto para principiantes como para usuarios avanzados. Creada para simplificar la interacción con la blockchain, Pactus GUI ofrece un diseño intuitivo y herramientas completas para gestionar nodos, validar transacciones y observar la actividad de la blockchain en tiempo real. A través de esta interfaz, los usuarios pueden realizar operaciones complejas de blockchain fácilmente sin necesidad de experiencia en línea de comandos, haciéndola accesible para una amplia gama de participantes.
fr: Pactus GUI est une interface graphique open-source et conviviale conçue pour offrir un accès fluide à la blockchain Pactus, tant pour les débutants que pour les utilisateurs avancés. Créée pour simplifier linteraction avec la blockchain, Pactus GUI propose une mise en page intuitive et des outils complets pour gérer les nœuds, valider les transactions et observer lactivité de la blockchain en temps réel. Grâce à cette interface, les utilisateurs peuvent facilement effectuer des opérations complexes sur la blockchain sans avoir besoin dexpérience en ligne de commande, la rendant accessible à un large éventail de participants.

source: Key Features and Functionalities
es: Características y Funcionalidades Clave
fr: Caractéristiques et Fonctionnalités Clés

source: Node Management
es: Gestión de Nodos
fr: Gestion des Nœuds

# answer_first_node_management
source: Setup and Configuration: Pactus GUI facilitates easy setup for running a blockchain node. It allows users to configure nodes as either full or pruned nodes, depending on their storage capacity and needs. Pruned Mode, introduced in recent versions, ensures nodes retain only the most recent blocks, optimizing storage and improving sync times
es: Configuración e Instalación: Pactus GUI facilita la configuración para ejecutar un nodo de blockchain. Permite a los usuarios configurar nodos como nodos completos o nodos podados, dependiendo de su capacidad de almacenamiento y necesidades. El Modo Podado, introducido en versiones recientes, asegura que los nodos solo retengan los bloques más recientes, optimizando el almacenamiento y mejorando los tiempos de sincronización.
fr: Configuration et Installation : Pactus GUI facilite la mise en place dun nœud de blockchain. Il permet aux utilisateurs de configurer les nœuds en tant que nœuds complets ou nœuds élagués, selon leur capacité de stockage et leurs besoins. Le mode élagué, introduit dans les versions récentes, garantit que les nœuds ne conservent que les blocs les plus récents, optimisant le stockage et améliorant les temps de synchronisation.

# answer_second_node_management
source: Node Type Selection: The GUI provides a streamlined onboarding process with a "Node Type" selection page, making it simple for users to switch between Full Node and Pruned Node setups based on storage capabilities and network role preferences.
es: Selección de Tipo de Nodo: La GUI ofrece un proceso de incorporación simplificado con una página de selección de Tipo de Nodo, que facilita a los usuarios alternar entre configuraciones de Nodo Completo y Nodo Podado según las capacidades de almacenamiento y preferencias de rol en la red.
fr: Sélection du Type de Nœud : Linterface graphique propose un processus dintégration simplifié avec une page de sélection du Type de Nœud, permettant aux utilisateurs de passer facilement entre les configurations de Nœud Complet et Nœud Élagué en fonction des capacités de stockage et des préférences de rôle dans le réseau.

source: Transaction Management
es: Gestión de Transacciones
fr: Gestion des Transactions

# answer_transaction_management
source: Through Pactus GUI, users can handle various transaction types, including sending and receiving PAC (Pactus is native token). The interface provides real-time transaction status, confirmations, and an overview of transaction history, making it easy for users to monitor their PAC activity. Advanced features, such as the gRPC API, allow developers to programmatically interact with the blockchain, pulling detailed transaction data
es: A través de Pactus GUI, los usuarios pueden manejar varios tipos de transacciones, incluyendo el envío y recepción de PAC (el token nativo de Pactus). La interfaz proporciona el estado de las transacciones en tiempo real, confirmaciones y un resumen del historial de transacciones, facilitando a los usuarios el seguimiento de su actividad con PAC. Las características avanzadas, como la API gRPC, permiten a los desarrolladores interactuar programáticamente con la blockchain, extrayendo datos detallados de transacciones.
fr: Via Pactus GUI, les utilisateurs peuvent gérer différents types de transactions, y compris lenvoi et la réception de PAC (le jeton natif de Pactus). Linterface fournit le statut des transactions en temps réel, les confirmations et un aperçu de lhistorique des transactions, facilitant le suivi de lactivité PAC par les utilisateurs. Des fonctionnalités avancées, telles que lAPI gRPC, permettent aux développeurs dinteragir de manière programmatique avec la blockchain, en extrayant des données détaillées sur les transactions.

source: Security and Privacy
es: Seguridad y Privacidad
fr: Sécurité et Confidentialité

# answer_security_and_privacy
source: Pactus GUI integrates enhanced security measures to ensure user data protection and safe transaction processing. With the latest update, Pactus has improved firewall functions to validate incoming messages and detect malicious attempts, ensuring a secure environment for users to interact with the blockchain. The system architecture and security features are constantly reviewed to align with the latest in blockchain security protocols
es: Pactus GUI integra medidas de seguridad mejoradas para garantizar la protección de los datos de los usuarios y el procesamiento seguro de transacciones. Con la última actualización, Pactus ha mejorado las funciones de firewall para validar mensajes entrantes y detectar intentos maliciosos, asegurando un entorno seguro para que los usuarios interactúen con la blockchain. La arquitectura del sistema y las características de seguridad se revisan constantemente para alinearse con los últimos protocolos de seguridad de blockchain.
fr: Pactus GUI intègre des mesures de sécurité renforcées pour garantir la protection des données des utilisateurs et le traitement sécurisé des transactions. Avec la dernière mise à jour, Pactus a amélioré les fonctions de pare-feu pour valider les messages entrants et détecter les tentatives malveillantes, assurant un environnement sécurisé pour les interactions des utilisateurs avec la blockchain. Larchitecture du système et les fonctionnalités de sécurité sont constamment examinées pour saligner sur les derniers protocoles de sécurité de la blockchain.
