Repository: pactus-project/pactus-gui
Catalog: lib/l10n/app_*.arb
Languages: es, fr

source: Decentralization and Accessibility
es: Descentralización y Accesibilidad
fr: Décentralisation et Accessibilité

# answer_decentralization_and_accessibility
source: As a decentralization-first blockchain, Pactus eliminates centralized control, allowing users to participate without intermediaries. The GUI further promotes this ethos by offering an accessible means to become a validator on the network. Users who stake PAC coins on their nodes gain validator privileges, participate in block creation, and earn rewards, all through the intuitive GUI. This democratizes access to the Pactus ecosystem, making blockchain participation possible for those without specialized technical knowledge
es: Como una blockchain que prioriza la descentralización, Pactus elimina el control centralizado, permitiendo a los usuarios participar sin intermediarios. La GUI promueve aún más este principio al ofrecer un medio accesible para convertirse en validador en la red. Los usuarios que apuestan monedas PAC en sus nodos obtienen privilegios de validador, participan en la creación de bloques y ganan recompensas, todo a través de la intuitiva GUI. Esto democratiza el acceso al ecosistema de Pactus, haciendo posible la participación en la blockchain para aquellos sin conocimientos técnicos especializados.
fr: En tant que blockchain privilégiant la décentralisation, Pactus élimine le contrôle centralisé, permettant aux utilisateurs de participer sans intermédiaires. Linterface graphique renforce cet ethos en offrant un moyen accessible de devenir validateur sur le réseau. Les utilisateurs qui misent des jetons PAC sur leurs nœuds obtiennent des privilèges de validateur, participent à la création de blocs et gagnent des récompenses, le tout via linterface graphique intuitive. Cela démocratise laccès à lécosystème Pactus, rendant la participation à la blockchain possible pour ceux qui nont pas de connaissances techniques spécialisées.

source: Committee Size
es: Tamaño del Comité
fr: Taille du Comité

source: Committee Power
es: Poder del Comité
fr: Puissance du Comité

source: Total Power
es: Poder Total
fr: Puissance Totale

source: Label
es: Etiqueta
fr: Étiquette

source: Address
es: Dirección
fr: Adresse

source: Committee
es: Comité
fr: Comité

source: Stake
es: Participación
fr: Enjeu

source: Submit
es: Enviar
fr: Soumettre

# noSeedGenerated
source: No seed words generated.
es: No se generaron palabras semilla.
fr: Aucune graine générée.

source: Generated Seed
es: Semilla Generada
fr: Graine Générée

source: Start Node
es: Iniciar Nodo
fr: Démarrer le Nœud

source: User Experience Enhancements
es: Mejoras en la Experiencia de Usuario
fr: Améliorations de l`expérience utilisateur

# answer_user_experience_enhancements
source: Pactus GUI is optimized for cross-platform compatibility, running smoothly on Windows, macOS, and Linux. This allows users across different operating systems to access the software effortlessly. The GUI is constantly updated to address issues, improve performance, and add new features, such as faster sync options and more efficient node management tools, enhancing the overall user experience.
es: La GUI de Pactus está optimizada para la compatibilidad multiplataforma, funcionando sin problemas en Windows, macOS y Linux. Esto permite a los usuarios de diferentes sistemas operativos acceder al software sin esfuerzo. La GUI se actualiza constantemente para solucionar problemas, mejorar el rendimiento y agregar nuevas funciones, como opciones de sincronización más rápidas y herramientas de gestión de nodos más eficientes, mejorando así la experiencia general del usuario.
fr: L`interface graphique de Pactus est optimisée pour une compatibilité multiplateforme, fonctionnant sans problème sur Windows, macOS et Linux. Cela permet aux utilisateurs de différents systèmes d`exploitation d`accéder au logiciel sans effort. L`interface est constamment mise à jour pour résoudre les problèmes, améliorer les performances et ajouter de nouvelles fonctionnalités, telles que des options de synchronisation plus rapides et des outils de gestion de nœuds plus efficaces, améliorant ainsi l`expérience utilisateur globale.

source: Real-Time Blockchain Monitoring
es: Monitoreo en Tiempo Real de la Blockchain
fr: Surveillance en temps réel de la blockchain

# answer_realtime_blockchain_monitoring
source: Users can monitor real-time data on the Pactus blockchain, including current block height, transaction rates, and network health, all displayed through an interactive dashboard within the GUI. This feature is especially useful for developers and power users who require detailed network insights for decision-making or development purposes. Pactus GUI embodies the projects commitment to creating a decentralized and user-friendly blockchain ecosystem. With continuous updates, the GUI is evolving to meet the needs of a growing user base, facilitating decentralized finance (DeFi) participation and empowering users to interact with blockchain technology easily and securely. Whether you`re looking to become a validator, manage transactions, or simply monitor blockchain activity, Pactus GUI offers an accessible and powerful solution for engaging with the Pactus network. With Pactus GUI, blockchain becomes intuitive and approachable, inviting users to take part in the decentralization movement through a simple, secure, and efficient platform.
es: Los usuarios pueden monitorear datos en tiempo real en la blockchain de Pactus, incluida la altura de bloque actual, las tasas de transacción y el estado de la red, todo mostrado a través de un panel interactivo dentro de la GUI. Esta característica es especialmente útil para desarrolladores y usuarios avanzados que requieren información detallada de la red para la toma de decisiones o fines de desarrollo. La GUI de Pactus encarna el compromiso del proyecto de crear un ecosistema blockchain descentralizado y fácil de usar. Con actualizaciones continuas, la GUI está evolucionando para satisfacer las necesidades de una base de usuarios en crecimiento, facilitando la participación en las finanzas descentralizadas (DeFi) y permitiendo a los usuarios interactuar con la tecnología blockchain de manera fácil y segura. Ya sea que desee convertirse en validador, gestionar transacciones o simplemente monitorear la actividad de la blockchain, la GUI de Pactus ofrece una solución accesible y potente para interactuar con la red Pactus. Con Pactus GUI, la blockchain se vuelve intuitiva y accesible, invitando a los usuarios a ser parte del movimiento de descentralización a través de una plataforma simple, segura y eficiente.
fr: Les utilisateurs peuvent surveiller les données en temps réel sur la blockchain Pactus, y compris la hauteur de bloc actuelle, les taux de transaction et l`état du réseau, le tout affiché via un tableau de bord interactif dans l`interface graphique. Cette fonctionnalité est particulièrement utile pour les développeurs et les utilisateurs avancés qui ont besoin d`informations détaillées sur le réseau pour la prise de décision ou le développement. L`interface graphique de Pactus incarne l`engagement du projet à créer un écosystème blockchain décentralisé et convivial. Avec des mises à jour continues, l`interface évolue pour répondre aux besoins d`une base d`utilisateurs en croissance, facilitant la participation à la finance décentralisée (DeFi) et permettant aux utilisateurs d`interagir avec la technologie blockchain de manière simple et sécurisée. Que vous souhaitiez devenir un validateur, gérer des transactions ou simplement surveiller l`activité de la blockchain, l`interface graphique de Pactus offre une solution accessible et puissante pour interagir avec le réseau Pactus. Avec Pactus GUI, la blockchain devient intuitive et abordable, invitant les utilisateurs à participer au mouvement de décentralisation à travers une plateforme simple, sécurisée et efficace.

source: Current application version
es: Versión actual de la aplicación
fr: Version actuelle de l`application

source: Coming Soon
fr: Prochainement

# generate_seed_button
source: Generate seed
fr: Générer une graine

# generate_button
source: Generate
fr: Générer

# seed_placeholder
source: Seed will appear here
fr: La graine apparaîtra ici

# password_mismatch_error
source: Passwords do not match!
fr: Les mots de passe ne correspondent pas !

# directory_creation_failed
source: Failed to create application directory. Please check permissions and try again.
fr: Échec de la création du répertoire. Veuillez vérifier les permissions et réessayer.

# error_node_duplicate_running
source: Duplicate node is running. The node is locked.
fr: Un nœud dupliqué est actif. Le nœud est verrouillé.

source: Network
fr: Réseau

source: Network ID
fr: ID du réseau

source: Working Dir
fr: Répertoire de travail

source: Encrypted Wallet
fr: Portefeuille chiffré

source: Client Version
fr: Version du client

source: Protocol Version
fr: Version du protocole

source: Node Type
fr: Type de nœud

source: Is Prune
fr: Est élagué

source: Protocols
fr: Protocoles

# error_no_internet
source: No internet connection or server unreachable
fr: Pas de connexion Internet ou serveur inaccessible

# error_timeout
source: Request timed out, please try again
fr: Délai d`attente dépassé, veuillez réessayer

# error_unexpected
source: Unexpected error
fr: Erreur inattendue

# error_grpc_cancelled
source: Request was cancelled
fr: La requête a été annulée

# error_grpc_unauthenticated
source: You are not authenticated
fr: Vous n`êtes pas authentifié

# error_grpc_permission_denied
source: Permission denied
fr: Permission refusée

# error_grpc_unavailable
source: Service temporarily unavailable
fr: Service temporairement indisponible

# error_grpc_deadline_exceeded
source: Server took too long to respond
fr: Le serveur a mis trop de temps à répondre

source: Transaction Type
fr: Type de Transaction

source: Withdraw
fr: Retirer

source: Bond
fr: Lier

source: Unbond
fr: Délier

source: Transfer
fr: Transférer

source: Result
fr: Résultat

source: Close
fr: Fermer

source: Validator
fr: Validateur

# addNote
source: Add a note...
fr: Ajouter une note...

# retryGettingData
source: Retry to getting Data
fr: Réessayer d\'obtenir les données

source: Memo
fr: Mémo

source: Select Validator
fr: Sélectionner le Validateur

source: Select Wallet
fr: Sélectionner le Portefeuille

source: Recipient
fr: Destinataire

source: Enter recipient address...
fr: Entrer l\'adresse du destinataire...

# error_grpc_unknown
source: Unknown gRPC error
fr: Erreur gRPC inconnue

source: Applications
es: Aplicaciones

# your_journey_finalized_description
source: Venturing into the realm of blockchain technology, Pactus heralds an era of uncompromised decentralization that stands in contrast to its contemporaries. It eschews traditional power hierarchies, parting ways with delegated proof-of-stake systems and mining operations that could lead to power concentration. By doing so, Pactus lowers its ramparts, inviting participants from all walks of life to join as equals in maintaining the network. Within this communal tapestry, every user has the opportunity to operate as a validator client, contributing to the network#s invulnerability to control or censorship, ensuring the platform#s integrity and autonomy.
es: Aventurándose en el ámbito de la tecnología blockchain, Pactus anuncia una era de descentralización sin compromisos que contrasta con sus contemporáneos. Rechaza las jerarquías de poder tradicionales, separándose de los sistemas de prueba de participación delegada y las operaciones de minería que podrían llevar a la concentración de poder. Al hacerlo, Pactus baja sus murallas, invitando a participantes de todos los ámbitos a unirse como iguales en el mantenimiento de la red. Dentro de este tapiz comunal, cada usuario tiene la oportunidad de operar como un cliente validador, contribuyendo a la invulnerabilidad de la red al control o censura, asegurando la integridad y autonomía de la plataforma.

# your_journey_finalized_description_last
source: Pactus isn#t just revolutionizing the structure of blockchain governance; it#s also remapping the user experience. Crafted with the conviction that blockchain should be accessible to all, the Pactus chain boasts a simple yet sophisticated graphical user interface (GUI) that demystifies the process of running a node. The elegance lies in its simplicity - a clear, approachable design that veils the robust and intricate mechanics beneath, allowing users, regardless of their technical prowess, to participate as validator clients. This move towards inclusivity transforms users from mere participants to guardians of the blockchain, an essential facet of the Pactus ecosystem.
es: Pactus no solo está revolucionando la estructura de la gobernanza blockchain; también está redefiniendo la experiencia del usuario. Diseñado con la convicción de que blockchain debería ser accesible para todos, la cadena Pactus cuenta con una interfaz gráfica de usuario (GUI) simple pero sofisticada que desmitifica el proceso de ejecución de un nodo. La elegancia radica en su simplicidad: un diseño claro y accesible que oculta la mecánica robusta y compleja debajo, permitiendo a los usuarios, independientemente de su destreza técnica, participar como clientes validadores. Este movimiento hacia la inclusión transforma a los usuarios de meros participantes en guardianes de la blockchain, un aspecto esencial del ecosistema Pactus.

source: ok
es: Aceptar

source: Public
es: Público

source: Transaction
es: Transacción

source: FAQ
es: Preguntas frecuentes

source: Score
es: Puntuación
